snlkuharlocal/src/DataProcessors/ВыгрузкаZabbix/ВыгрузкаZabbix.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаZabbix</name>
  <attributes>
    <name>КаталогВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортАгента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/Логи/Логи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Логи</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЛога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>День</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/DataProcessors/ВыгрузкаZabbix/ObjectModule.bsl
Перем ИмяЛога;
Перем ТипУИД;
Перем ТипДата;
Перем сИБ;

Функция ПолучитьПараметры() Экспорт
	тПараметры = Новый ТаблицаЗначений;
	
	тПараметры.Колонки.Добавить("Имя");
	тПараметры.Колонки.Добавить("Значение");
	тПараметры.Колонки.Добавить("Комментарий");
	
	ДобавитьШаблонПараметра(тПараметры, "КаталогВыгрузки", 	"", 	"Каталог выгрузки");	
	ДобавитьШаблонПараметра(тПараметры,	"Сервер",			"", 	"Сервер 1С");
	ДобавитьШаблонПараметра(тПараметры,	"Порт",				1545,	"Порт RAS"); 
	
	ДобавитьШаблонПараметра(тПараметры,	"Пользователь",		"", 	"Пользователь");
	ДобавитьШаблонПараметра(тПараметры,	"Пароль",			"", 	"Пароль");
	
	Возврат тПараметры;
КонецФункции //ПолучитьПараметры() Экспорт

Функция ДобавитьШаблонПараметра(тПараметры, Имя, Значение = Неопределено, Комментарий = Неопределено)
	СтрокаТП = тПараметры.Добавить();
	
	СтрокаТП.Имя			= Имя;
	СтрокаТП.Значение		= Значение;
	СтрокаТП.Комментарий	= Комментарий;
КонецФункции //ДобавитьШаблонПараметра(тПараметры, Имя, Значение = Неопределено, Комментарий = Неопределено)

Функция Сформировать(тПараметры = Неопределено) Экспорт
	Если ТипЗнч(тПараметры) = Тип("ТаблицаЗначений") Тогда
		пОбработки = Регламент.ТаблицаПараметровВСоответствие(тПараметры);
	Иначе
		пОбработки = тПараметры;		
	КонецЕсли;
	
	рПолучения = ПолучитьПоказатели(пОбработки);
	Если рПолучения.Успешно Тогда
	    ВыгрузитьДанные(рПолучения.Данные, пОбработки);
	Иначе
		ТекстСообщения = СтрШаблон("Не удалось получить показатели для Zabbix ! %1", СтрСоединить(рПолучения.Ошибки, Символы.ПС));
		ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Ошибка");	
	КонецЕсли;	
КонецФункции

Функция ПолучитьПоказатели(пОбработки) Экспорт
	Результат 		= МаркировкаКС.СтруктураРезультата();
	
	рПолученияRAS	= ПолучитьПоказателиRAS(пОбработки);
	рПолученияCOM 	= ПолучитьПоказателиCOM(пОбработки);
	рПолученияЛоги	= ПолучитьПоказателиЛоги(пОбработки);
	
	Если рПолученияRAS.Успешно Тогда
		ДопПоказатели = МаркировкаКС.ПолучитьЗначениеПараметра(рПолученияRAS.Данные, "ДопПоказатели", Новый Структура);
		
		Если рПолученияCOM.Успешно Тогда
			Для каждого КиЗ Из рПолученияCOM.Данные Цикл
				ДопПоказатели.Вставить(ПреобразоватьИмяПоказателя(КиЗ.Ключ), КиЗ.Значение);			
			КонецЦикла;		
		Иначе
			ТекстСообщения = СтрШаблон("Не удалось получить показатели COM по причине: '%1' !", СтрСоединить(рПолученияCOM.Ошибки, Символы.ПС));
			ЗаписатьВЛог(ИмяЛога, ТекстСообщения, "Ошибка");
		КонецЕсли;
		
		Для каждого КиЗ Из рПолученияЛоги.Данные Цикл
			ДопПоказатели.Вставить(ПреобразоватьИмяПоказателя(КиЗ.Ключ), КиЗ.Значение);			
		КонецЦикла;
		
		рПолученияRAS.Данные.Вставить("ДопПоказатели", ДопПоказатели);		
		
		Результат.Данные = рПолученияRAS.Данные;
		Результат.Данные.Вставить("ДанныеДляЗабикс", СоздатьСтрокуДанныхДляZabbix(Результат.Данные.Сеансы, Результат.Данные.ДопПоказатели));		
	Иначе                                  
		МаркировкаКС.ДобавитьОшибки(Результат, рПолученияRAS);
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат;
КонецФункции //ПолучитьПоказатели(пОбработки) Экспорт

Процедура Сформировать_(тПараметры = Неопределено) Экспорт
	Соединение = Новый COMОбъект("V83.COMConnector");
	
	Агент = Соединение.ConnectAgent("tcp://Srv-data");
	Кластер = Агент.GetClusters().GetValue(0);
	//Агент.Authenticate(Кластер, "Кухарь А.Ю.", "958kf63");
	Агент.Authenticate(Кластер, "", "");
	
	МассивСессий = Агент.GetSessions(Кластер).Выгрузить();
	
	countSession = 0; // Счетчик сессий
	countHibernate = 0; // счетчик уснувших сессий
	
	// показатели активных сессий
	durationCurrentDBMSМакс = 0; 
	durationCurrentМакс = 0;
	dbProcTookМакс = 0;
	
	тСессии = СоздатьТаблицуСоединений();	
	
	Для Каждого Сессия Из МассивСессий Цикл
		Если Сессия.AppID = "SrvrConsole" Тогда
			Продолжить; // пропускаем сессии консоли
		КонецЕсли;
		
		СтрТЗ = тСессии.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЗ, Сессия);
		СтрТЗ.infoBase = Сессия.infoBase.Name;
		СтрТЗ.Количество = 1;
		
		countSession = countSession + 1;
		
		durationCurrentDBMSМакс = Макс(durationCurrentDBMSМакс, Сессия.durationCurrentDBMS);
		durationCurrentМакс 	= Макс(durationCurrentМакс, Сессия.durationCurrent);
		dbProcTookМакс 			= Макс(dbProcTookМакс, Сессия.dbProcTook); 
		
		Если Сессия.Hibernate Тогда
			countHibernate = countHibernate + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Получаем пользователей с большим количеством сеансов
	UserMaxCount = 0;
	UserMaxName = "";
	ТаблUserName = тСессии.Скопировать();
	ТаблUserName.Свернуть("userName", "Количество");
	ТаблUserName.Сортировать("Количество Убыв");
	Для Каждого Стр Из ТаблUserName Цикл 
		UserMaxCount = Стр.Количество;
		UserMaxName = Стр.userName;
		Прервать;
	КонецЦикла;
	
	// Получаем компьютеры с большим количеством сеансов
	HostMaxCount = 0;
	HostMaxName = "";
	ТаблHost = тСессии.Скопировать();
	ТаблHost.Свернуть("Host", "Количество");
	ТаблHost.Сортировать("Количество Убыв");
	Для Каждого Стр Из ТаблHost Цикл 
		HostMaxCount	= Стр.Количество;
		HostMaxName		= Стр.Host;
		Прервать;
	КонецЦикла;	
	
	Строка =          "- 1c.avaible 1" + Символы.ПС;
	
	Строка = Строка + "- 1c.sessions.count "        + Формат(countSession,             "ЧН=0; ЧГ=0") + Символы.ПС;
	Строка = Строка + "- 1c.hibernate.count "       + Формат(countHibernate,           "ЧН=0; ЧГ=0") + Символы.ПС;
	Строка = Строка + "- 1c.dbproctook.current "    + Формат(dbProcTookМакс,           "ЧН=0; ЧГ=0") + Символы.ПС;
	Строка = Строка + "- 1c.duration.current.dbms " + Формат(durationCurrentDBMSМакс,  "ЧН=0; ЧГ=0") + Символы.ПС;
	Строка = Строка + "- 1c.duration.current.1c "   + Формат(durationCurrentМакс,      "ЧН=0; ЧГ=0") + Символы.ПС;
	
	Строка = Строка + "- 1c.user.count " + Формат(UserMaxCount, "ЧН=0; ЧГ=0") + Символы.ПС;
	Строка = Строка + "- 1c.host.count " + Формат(HostMaxCount, "ЧН=0; ЧГ=0") + Символы.ПС;
	Строка = Строка + "- 1c.user.name "  + """" + UserMaxName + """"          + Символы.ПС;
	Строка = Строка + "- 1c.host.name "  + """" + HostMaxName + """"          + Символы.ПС;
	
	ЗаписьТекста = Новый ЗаписьТекста("C:\Program Files\Zabbix Agent\tmp.txt", "CESU-8",, Ложь, Символы.ПС); //ТекстБезБОМ
	ЗаписьТекста.Записать(Строка);
	ЗаписьТекста.Закрыть();
	
	КомандаZabbix = """C:\Program Files\Zabbix Agent\zabbix_sender.exe"" -c ""C:\Program Files\Zabbix Agent\zabbix_agentd.conf"" -i ""C:\Program Files\Zabbix Agent\tmp.txt""";
	ЗапуститьПриложение(КомандаZabbix);	
	
	
	/////////////////////////////////////////////////////    Лидеры по захвачено  СУБД + блокировки в отдельный файл  
	MAxdbProcTook = 0;
	MAxdbProcTookName = "";
	Табл = тСессии.Скопировать();
	Табл.Свернуть("userName", "dbProcTook");
	Табл.Сортировать("dbProcTook Убыв");
	Для Каждого Стр Из Табл Цикл 
		MAxdbProcTook = окр(Стр.dbProcTook/1000,2);
		MAxdbProcTookName = Стр.userName;
		Прервать;
	КонецЦикла;		
	
	ТЗБлокировок = тСессии.Скопировать();
	ТЗБлокировок.Свернуть("userName,blockedByDBMS,SessionID");
	СтрокаБлокируемых="";
	СтрокаБлокирующих="";
	Для каждого СтрТЗ из ТЗБлокировок цикл
		если СтрТЗ.blockedByDBMS <>0 тогда
			если найти(СтрокаБлокируемых,СтрТЗ.userName)= 0 тогда
				СтрокаБлокируемых=СтрокаБлокируемых+СтрТЗ.userName+", ";
			КонецЕсли;
			
			НайденаяСтрока=ТЗБлокировок.Найти(СтрТЗ.blockedByDBMS);
			если НайденаяСтрока<>Неопределено тогда
				если найти(СтрокаБлокирующих,НайденаяСтрока.userName) = 0 тогда
					СтрокаБлокирующих=СтрокаБлокирующих+НайденаяСтрока.userName+", ";
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;
	
	СтрокаБлокируемых	= Сред(СтрокаБлокируемых,1,СтрДлина(СтрокаБлокируемых)-2);
	СтрокаБлокирующих	= Сред(СтрокаБлокирующих,1,СтрДлина(СтрокаБлокирующих)-2);
	СтрокаБлокировки 	= СтрокаБлокирующих+" ,блокируют "+СтрокаБлокируемых; 	
	
	Строка = "";
	Если СтрДлина(СтрокаБлокируемых)>0 или СтрДлина(СтрокаБлокирующих)>0 тогда
		Строка = Строка + "ER Заблокированные пользователи "  + """" + СтрокаБлокировки + """"          + Символы.ПС;
	КонецЕсли;
	
	Строка = Строка + "Лидер захвачено СУБД. "    + MAxdbProcTook  + "-сек   ";
	Строка = Строка + "Имя лидера захвачено СУБД "  + """" + MAxdbProcTookName + """"     + Символы.ПС;
	
	ОтправитьПоказателиВЗабикс(Строка);
	
КонецПроцедуры   

Функция ТестCOM(тПараметры = Неопределено) Экспорт
	Если ТипЗнч(тПараметры) = Тип("ТаблицаЗначений") Тогда
		пОбработки = Регламент.ТаблицаПараметровВСоответствие(тПараметры);
	Иначе
		пОбработки = тПараметры;		
	КонецЕсли;
		
	Возврат ПолучитьПоказателиCOM(пОбработки);	
КонецФункции //ТестCOM(тПараметры = Неопределено) Экспорт

Функция ПолучитьПоказателиCOM(пОбработки)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Агент	= Неопределено;
	Кластер = Неопределено;	
	
	рПодключения = УстановитьСоединениеСКластером_COM(пОбработки);	
	Если рПодключения.Успешно Тогда                               
		Агент 	= рПодключения.Данные.Агент;
		Кластер = рПодключения.Данные.Кластер;	
	Иначе
		Возврат рПодключения;		
	КонецЕсли;	
	
	dbProcTook_max_time = 0;	
	dbProcTook_max_user = 0;
	dbProcTook_max_start = '00010101';
	
	dbProcTook_total_time = 0;	
	
	ИмяБазы = ИмяТекущейИБ();
	
	МассивСессий = Агент.GetSessions(Кластер).Выгрузить();
	Для каждого Сессия Из МассивСессий Цикл
		Если ИмяБазы = НРег(Сессия.InfoBase.name) Тогда
			Если Сессия.dbProcTook > 0 Тогда
				dbProcTook_total_time = dbProcTook_total_time + Сессия.dbProcTook;
				Если Сессия.dbProcTook > dbProcTook_max_time Тогда
					dbProcTook_max_time 	= Сессия.dbProcTook;
					dbProcTook_max_user		= Сессия.UserName;
					dbProcTook_max_start	= Сессия.dbProcTookAt;			
				КонецЕсли;			
			КонецЕсли;			
		КонецЕсли;		
	КонецЦикла;
	
	dbProcTook_max_time 	= dbProcTook_max_time / 1000;
	dbProcTook_total_time   = dbProcTook_total_time / 1000;
	
	Результат.Данные = Новый Структура("dbProcTook_max_time,dbProcTook_max_user,dbProcTook_max_start,dbProcTook_max_time,dbProcTook_total_time",
		dbProcTook_max_time,dbProcTook_max_user,dbProcTook_max_start,dbProcTook_max_time,dbProcTook_total_time
	);
	
	Возврат Результат;
КонецФункции //ПолучитьПолказателиCOM(пОбработки)

Функция ПолучитьПоказателиЛоги(пОбработки)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Автор) 		КАК km_query_user_count, 	//КоличествоПользователей
	|	СУММА(1)							КАК km_query_query_count, 	//КоличествоЗапросов
	|	СУММА(
	|		ВЫБОР 
	|			КОГДА Логи.ТипСообщения = ""Ошибка"" ТОГДА 1
	|			КОГДА Логи.Сообщение ПОДОБНО ""%отмена%"" ТОГДА 1
	|		ИНАЧЕ 0 
	|		КОНЕЦ
	|	) КАК km_query_trans_error_count, //КоличествоОшибкиТранзакций
	|	СУММА(ВЫБОР КОГДА ВремяВыполненния>10 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК km_query_jump_count, //КоличествоВыбросов
	|	СУММА(ВремяВыполненния) 			КАК km_query_total_time, 	//ВремяВыполненияПолное
	|	СУММА(ВремяВыполненния)/СУММА(1) 	КАК km_query_avg_time, 		//ВремяВыполненияСреднее
	|	МАКСИМУМ(ВремяВыполненния) 			КАК km_query_max_time 		//ВремяВыполненияМаксимальное
	|ИЗ
	|	РегистрСведений.Логи КАК Логи
	|ГДЕ
	|	Дата МЕЖДУ &Дата1 И &Дата2
	|	И Логи.ИмяЛога = ""Мониторинг СтатусыКМ_Факт""	
	|";
	
	Дата2 = НачалоМинуты(ТекущаяДата())-1;
	
	Запрос.УстановитьПараметр("Дата1", НачалоМинуты(Дата2));
	Запрос.УстановитьПараметр("Дата2", КонецМинуты(Дата2));
	
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Данные = Новый Структура("km_query_user_count,km_query_query_count,km_query_trans_error_count,km_query_jump_count,km_query_total_time,km_query_max_time,km_query_avg_time",
		0,0,0,0,0,0,0
	);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.km_query_query_count) Тогда
		ЗаполнитьЗначенияСвойств(Данные, Выборка);			
	КонецЕсли; 

	Результат.Данные = Данные;
	
	Возврат Результат;
КонецФункции //ПолучитьПоказателиЛоги(пОбработки)
 

Функция УстановитьСоединениеСКластером_COM(пОбработки)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Сервер			= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Сервер");
	Порт			= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Порт");
	ПортАгента		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ПортАгента", 		1540);
	Пользователь	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Пользователь",	"");
	Пароль			= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Пароль",			"");
	
	Соединение = Неопределено;
	Попытка
		Соединение = Новый COMОбъект("V83.COMConnector");		
	Исключение
		ТекстОшибки	= СтрШаблон("Не удалось установить COM соедиение с кластером ! %1", ОписаниеОшибки());
		ЗаписатьВЛог(ИмяЛога, ТекстОшибки, "Ошибка");
		
		Результат.Ошибки.Добавить(ТекстОшибки);
	КонецПопытки;	          
	
	Если Соединение <> Неопределено Тогда   
		СтрокаСоединения = СтрШаблон("%1:%2", Сервер, МаркировкаКС.ЧислоБезДури(ПортАгента));
		Агент	= Соединение.ConnectAgent(СтрокаСоединения);
		
		Если Агент = Неопределено Тогда
			ТекстСообщения = СтрШаблон("Не удалось установить соединение с агентом кластера 1С (COM) ! Строка соединения: '%1'.", СтрокаСоединения);
			Результат.Ошибки.Добавить(ТекстСообщения);
			Сообщить(ТекстСообщения);		
		Иначе
			Кластер		= Неопределено;
			Кластеры	= Агент.GetClusters();
			Для каждого ТекКластер Из Кластеры Цикл
				Если ТекКластер.MainPort = ПортАгента + 1 Тогда
					Кластер = ТекКластер;
					Прервать;				
				КонецЕсли;			
			КонецЦикла;
			
			Если Кластер = Неопределено Тогда
				ТекстОшибки	= СтрШаблон("Не найден кластер 1С на порту: %1 !", (ПортАгента + 1));
				ЗаписатьВЛог(ИмяЛога, ТекстОшибки, "Ошибка");
				
				Результат.Ошибки.Добавить(ТекстОшибки);
			Иначе				
				Попытка			
					Агент.Authenticate(Кластер, Пользователь, Пароль);			
					Результат.Данные = Новый Структура("Агент,Кластер", Агент,Кластер);
				Исключение
					ТекстОшибки	= СтрШаблон("Ошибка аутентификации в кластере ! %1", ОписаниеОшибки());
					ЗаписатьВЛог(ИмяЛога, ТекстОшибки, "Ошибка");
					
					Результат.Ошибки.Добавить(ТекстОшибки);
				КонецПопытки;			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);		
	
	Возврат Результат;		
КонецФункции //УстановитьСоединениеСКластером_COM(пОбработки)

Функция ВыгрузитьДанные(Данные, пОбработки)
	СтрокаДанныеДляZabbix = СоздатьСтрокуДанныхДляZabbix(Данные.Сеансы, Данные.ДопПоказатели);
	
	КаталогВыгрузки = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "КаталогВыгрузки");	
	
	рЗаписи = ЗаписатьДанныеЗабиксВФайл(СтрокаДанныеДляZabbix);
	Если рЗаписи.Успешно Тогда
					
	Иначе
		ТекстОшибки = СтрШаблон("Ошибка записи данных Zabbix в файл. " + СтрСоединить(рЗаписи.Ошибки, Символы.ПС));
		ЗаписатьВЛог(ИмяЛога, ТекстОшибки, "Ошибка");
	КонецЕсли;	
КонецФункции //ВыгрузитьДанные(пОбработки)

Функция ЗаписатьДанныеЗабиксВФайл(СтрокаДанных) Экспорт
	Результат 	= МаркировкаКС.СтруктураРезультата();
	
	ТекИмяФайла = "";
	
	Если ЗначениеЗаполнено(КаталогВыгрузки) Тогда
		Файл = Новый Файл(КаталогВыгрузки);	
		Если Файл.Существует() Тогда
			Если ЗначениеЗаполнено(СтрокаДанных) Тогда            
				ТекИмяФайла = СокрЛП(КаталогВыгрузки);
				Если НЕ СтрЗаканчиваетсяНа(ТекИмяФайла, ПолучитьРазделительПути()) Тогда
					ТекИмяФайла = ТекИмяФайла + ПолучитьРазделительПути();		
				КонецЕсли;        
				
				ТекИмяФайла = ТекИмяФайла + СтрШаблон("to_zbx_%1.json", Маркировка_ПИ.ЭтотУзел_Код());
				ТекИмяФайла	= НРег(ТекИмяФайла);
				
				ДД = ПолучитьДвоичныеДанныеИзСтроки(СтрокаДанных);
				ДД.Записать(ТекИмяФайла);
			Иначе     
				ТекстОшибки = СтрШаблон("Не найден каталог выгрузки: '%1' !", КаталогВыгрузки);
				Результат.Ошибки.Добавить("Пустая строка данных Zabbix !");
			КонецЕсли;			
		Иначе			
			Результат.Ошибки.Добавить("Пустая строка данных Zabbix !");
		КонецЕсли;
	Иначе
		Результат.Ошибки.Добавить("Не указан каталог выгрузки !");		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекИмяФайла) Тогда
		Результат.Данные = ТекИмяФайла;
	Иначе
		Результат.Успешно = Ложь;	
	КонецЕсли;	 
	
	Возврат Результат;
КонецФункции //СоздатьДанныеЗабиксВФайл(СтрокаДанных)

Функция ПолучитьПоказателиRAS(пОбработки = Неопределено) Экспорт               
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Начало	= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	КаталогВыгрузки = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "КаталогВыгрузки");
	Сервер			= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Сервер");
	Порт			= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Порт");	
	ПортАгента		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ПортАгента");	
	Пользователь	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Пользователь");
	Пароль			= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Пароль", "");
	
	АС	= Неопределено;
	Попытка		
		АС	= Новый АдминистрированиеСервера(Сервер, Порт);
	Исключение                     
		ТекстОшибки = СтрШаблон("Не удалось подключиться к кластеру 1С (%1:%2) ! %3.", Сервер, Порт, ОписаниеОшибки());
		Результат.Ошибки.Добавить(ТекстОшибки);
		Результат.Успешно = Ложь;
		Возврат Результат;
	КонецПопытки;
	
	Если АС <> Неопределено Тогда
		Кластеры = АС.ПолучитьКластеры();
		Если Кластеры.Количество() = 0  Тогда
			Результат.Ошибки.Добавить("получено 0 кластеров.");					
		КонецЕсли;                          
		
		КластерИмя = "";
		
		Для каждого Кластер Из Кластеры Цикл
			Если Кластер.Порт <> (ПортАгента + 1)  Тогда Продолжить КонецЕсли; 
			
			КластерИмя = Кластер.Имя;
			
			ЕстьАутентификация = Ложь;
			Попытка				
				Если Пользователь = Неопределено Тогда				
					Кластер.ВыполнитьАутентификацию();	
				Иначе
					Кластер.ВыполнитьАутентификацию(Пользователь, Пароль);
				КонецЕсли;
				
				ЕстьАутентификация = Истина;
			Исключение                    
				ТекстОшибки = СтрШаблон("Ошибка аутентификации в кластере: '%1'. %2.", Кластер.Имя, ОписаниеОшибки());
				Результат.Ошибки.Добавить(ТекстОшибки);
				Продолжить;				
			КонецПопытки;			
			
			ИБ = Кластер.ПолучитьИнформационныеБазы();
			сИБ = Новый Соответствие();
			Для каждого ИБ Из Кластер.ПолучитьИнформационныеБазы() Цикл
				сИБ[ИБ.ИдентификаторИнформационнойБазы] = НРег(ИБ.Имя);
			КонецЦикла;
			
			тСеансы 	= ПолучитьСеансы(Кластер);		
			
			тСоединения = ПолучитьСоединения(Кластер, тСеансы);		
			
			тБлокировки = ПолучитьБлокировки(Кластер, тСеансы);
			
			БлокировкаМакс_Длительность = 0;
			БлокировкаМакс_Пользователь = "";
			Если тБлокировки.Количество() > 0 Тогда
				БлокировкаМакс_Длительность	= тБлокировки[0].ДлительностьБлокировки;
				БлокировкаМакс_Пользователь	= тБлокировки[0].ИмяПользователя;
			КонецЕсли;
			
			ВремяВКонфигураторе      	= 0;
			ПользовательКонфигуратора	= "";
			
			тСоединения.Сортировать("DesignerTime УБЫВ");
			Если тСоединения.Количество() > 0 И тСоединения[0].DesignerTime > 0 Тогда
				СтрСоединения = ВРег(СтрокаСоединенияИнформационнойБазы());
				Для каждого Соединение Из тСоединения Цикл
					Если Соединение.DesignerTime > 0 Тогда
						Если СтрНайти(СтрСоединения, """"+ВРег(Соединение.InfoBase)+"""") > 0 Тогда
							ВремяВКонфигураторе      	= тСоединения[0].DesignerTime;
							ПользовательКонфигуратора	= тСоединения[0].UserName;
						КонецЕсли;
					Иначе
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ДопПоказатели = Новый Соответствие;
			ДопПоказатели["designer_time"] 			= ВремяВКонфигураторе;
			ДопПоказатели["designer_user"] 			= ПользовательКонфигуратора;			
			ДопПоказатели["lockduration_max_time"] 	= БлокировкаМакс_Длительность;
			ДопПоказатели["lockduration_max_user"]	= БлокировкаМакс_Пользователь;			
				
			Результат.Данные = Новый Структура("Соединения,Блокировки,Сеансы,ДопПоказатели", тСоединения, тБлокировки, тСеансы, ДопПоказатели);
		КонецЦикла;
	КонецЕсли;
	
	Если ПустаяСтрока(КластерИмя) Тогда
		Результат.Ошибки.Добавить("Не удалось найти кастер 1С ! Порт: " + ПортАгента);
	КонецЕсли;
	
	Результат.ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	
	Результат.Успешно = (Результат.Ошибки.Количество() = 0);
	
	Возврат Результат; 
КонецФункции //ПолучитьДанныеRAS(пОбработки = Неопределено) Экспорт

Функция ПолучитьБлокировки(Кластер, Сеансы)
	тРезультат = СоздатьТаблицуБлокировок();
	
	ИмяТекущейБазы	= ИмяТекущейИБ();
	ПустойУИД 		= Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Для каждого Блокировка Из Кластер.ПолучитьБлокировки() Цикл
		Если НЕ СтрНачинаетсяС(Блокировка.Описание, "Объект БД") Тогда Продолжить КонецЕсли;		
		
		Сеанс = Сеансы.Найти(Блокировка.ИдентификаторСеанса, "ИдентификаторСеанса");
		Если Сеанс <> Неопределено Тогда
			Если ВРег(Сеанс.ApplicationName) <> ВРег("Designer") Тогда
				ИмяБазы = сИБ[Сеанс.ИдентификаторИнформационнойБазы];
				Если ИмяТекущейБазы = ИмяБазы Тогда
					Если Блокировка.ИдентификаторОбъекта<>ПустойУИД Тогда						
						СтрокаР = тРезультат.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаР, Блокировка);	
						
						СтрокаР.ИмяКомпьютера	= Сеанс.ComputerName;
						СтрокаР.ИмяПользователя = Сеанс.UserName;
						СтрокаР.ИмяПриложения	= Сеанс.ApplicationName;
						СтрокаР.ИмяБазы			= сИБ[Сеанс.ИдентификаторИнформационнойБазы];
						
						СтрокаР.ДлительностьБлокировки = ТекущаяДата() - СтрокаР.ВремяНачалаБлокировки;				
					КонецЕсли;
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;                                       
	
	тРезультат.Сортировать("ДлительностьБлокировки УБЫВ");
	
	Возврат тРезультат;
КонецФункции // ()

Функция ПолучитьСоединения(Кластер, Сеансы)
	тСоединения = СоздатьТаблицуСоединений();	
	
	Для каждого Соединение Из Кластер.ПолучитьСоединения() Цикл
		СтрокаСоед = тСоединения.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаСоед, Соединение);
		
		//ЗаполнитьЗначенияСвойств(СтрТЗ, Соединение);
		СтрокаСеанса = Сеансы.Найти(Соединение.ИдентификаторСоединения, "ИдентификаторСоединения");
		Если СтрокаСеанса<>Неопределено Тогда					
			СтрокаСоед.userName	= СтрокаСеанса.UserName;
		КонецЕсли;				
		
		СтрокаСоед.host 	= Соединение.ИмяКомпьютера;		
		
		Если ВРег(Соединение.ИмяПриложения) = ВРег("designer") Тогда
			СтрокаСоед.DesignerTime = ТекущаяДата() - Соединение.ВремяУстановкиСоединения; 									
		КонецЕсли;
		
		//СтрТЗ.blockedByDBMS 	= Соединение.НомерСеансаБлокирующегоСУБД; 
		//СтрТЗ.blockedByLS		= Соединение.НомерСеансаВыполнившегоУправляемуюБлокировку; 
		
		СтрокаСоед.ConnectionID	= Соединение.ConnectionID;
		СтрокаСоед.infoBase 	= сИБ[Соединение.ИдентификаторИнформационнойБазы];
		
		СтрокаСоед.Количество = 1;				
	КонецЦикла;	             
			
	Возврат тСоединения;		
КонецФункции // ()

Функция ПолучитьСеансы(Кластер)
	тРезультат = СоздатьТаблицуСеансов();
	
	Для каждого Сеанс Из Кластер.ПолучитьСеансы() Цикл
		СтрокаС = тРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаС, Сеанс);	
		
		СтрокаС.SessionTime = ТекущаяДата() - СтрокаС.BeginTime;
	КонецЦикла;
	
	Возврат тРезультат;	
КонецФункции //ПолучитьСеансы(Кластер)


Функция СоздатьТаблицуСеансов()
	ТипСтрока	= ПолучитьОписаниеТиповСтроки(200);
	ТипЧисло	= ПолучитьОписаниеТиповЧисла(10, 0);
	ТипДата		= ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя);
	ТипУИД		= Новый ОписаниеТипов("УникальныйИдентификатор");
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("ClientIPAddress", 							ТипСтрока);
	ТЗ.Колонки.Добавить("BeginTime", 								ТипДата);
	ТЗ.Колонки.Добавить("LastDBMSCallTime", 						ТипДата);
	ТЗ.Колонки.Добавить("CallDurationTotal",						ТипЧисло);
	
	ТЗ.Колонки.Добавить("DBMSCallDurationLast5Min",					ТипЧисло);	
	ТЗ.Колонки.Добавить("DBMSCallDurationTotal",					ТипЧисло);
	ТЗ.Колонки.Добавить("DBMSCallDurationCurrent",					ТипЧисло);	
	
	ТЗ.Колонки.Добавить("ComputerName",								ТипСтрока);
	ТЗ.Колонки.Добавить("UserName",									ТипСтрока);
	ТЗ.Колонки.Добавить("ApplicationName",							ТипСтрока);	
	
	ТЗ.Колонки.Добавить("DBMSLockSessionNumber",					ТипЧисло);        
	ТЗ.Колонки.Добавить("ManagedLockSessionNumber",					ТипЧисло);
	ТЗ.Колонки.Добавить("CPUTimeCurrent",							ТипЧисло);
	ТЗ.Колонки.Добавить("MemoryUsageCurrent",						ТипЧисло);	
	
	ТЗ.Колонки.Добавить("SessionNumber",							ТипЧисло);
	ТЗ.Колонки.Добавить("SessionTime", 								ТипЧисло);
	
	ТЗ.Колонки.Добавить("ИдентификаторИнформационнойБазы",			ТипУИД);      
	ТЗ.Колонки.Добавить("ИдентификаторСеанса",						ТипУИД);                            
	ТЗ.Колонки.Добавить("ИдентификаторСоединения",					ТипУИД);
	
	ТЗ.Индексы.Добавить("ИдентификаторСеанса");
	ТЗ.Индексы.Добавить("ИдентификаторСоединения");
	
	Возврат ТЗ;
КонецФункции //СоздатьТаблицуСеансов()

Функция СоздатьТаблицуСоединений()
	ТипСтрока	= ПолучитьОписаниеТиповСтроки(200);
	ТипЧисло	= ПолучитьОписаниеТиповЧисла(10, 0);
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("InfoBase", 		ТипСтрока);
	ТЗ.Колонки.Добавить("ApplicationName",	ТипСтрока);
	ТЗ.Колонки.Добавить("UserName", 		ТипСтрока);
	ТЗ.Колонки.Добавить("Host",				ТипСтрока);
	
	ТЗ.Колонки.Добавить("Количество",		ТипЧисло);
	
	ТЗ.Колонки.Добавить("BlockedByLS",		ТипЧисло); 	//ID сеанса который заблокировал текущего пользователя
	ТЗ.Колонки.Добавить("BlockedByDBMS",	ТипЧисло);	//ID сеанса который заблокировал текущего пользователя
	
	ТЗ.Колонки.Добавить("DbProcTook",		ТипЧисло);  //Захвачено СУБД
	ТЗ.Колонки.Добавить("ConnectionID",		ТипУИД);	//ИД соединения
	ТЗ.Колонки.Добавить("ConnectionTime",	ТипДата);   //ВремяУстановкиСоединения
	ТЗ.Колонки.Добавить("SessionNumber",	ТипЧисло);  //НомерСеанса
	
	ТЗ.Колонки.Добавить("DesignerTime",		ТипЧисло);  //Время в конфигураторе	
	
	
	Возврат ТЗ;
КонецФункции //СоздатьТаблицуСессий()

Функция СоздатьТаблицуБлокировок()
	ТипСтрока	= ПолучитьОписаниеТиповСтроки(200);
	ТипЧисло	= ПолучитьОписаниеТиповЧисла(10, 0);	
	
	ТЗ = Новый ТаблицаЗначений;	
	
	ТЗ.Колонки.Добавить("ИмяБазы", 				ТипСтрока);
	ТЗ.Колонки.Добавить("ИмяПриложения", 		ТипСтрока);
	ТЗ.Колонки.Добавить("ИмяПользователя", 		ТипСтрока);
	ТЗ.Колонки.Добавить("ИмяКомпьютера", 		ТипСтрока);
	
	ТЗ.Колонки.Добавить("ВремяНачалаБлокировки", 	ТипДата);
	ТЗ.Колонки.Добавить("ДлительностьБлокировки", 	ТипЧисло);	
	ТЗ.Колонки.Добавить("Описание",					ТипСтрока);
	
	ТЗ.Колонки.Добавить("ИдентификаторОбъекта", 	ТипУИД);
	ТЗ.Колонки.Добавить("ИдентификаторСеанса", 		ТипУИД);
	ТЗ.Колонки.Добавить("ИдентификаторСоединения",	ТипУИД);
	
	Возврат ТЗ;
КонецФункции //СоздатьТаблицуСессий()


Функция СоздатьСтрокуДанныхДляZabbix(Сеансы, ДопПоказатели)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_Сеансы ИЗ &Сеансы КАК Сеансы
	|;
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИдентификаторСеанса) 	КАК Session_Count,
	|	СУММА(CallDurationTotal)/1000				КАК CallDuration_Total,
	|	МАКСИМУМ(CallDurationTotal)/1000			КАК CallDuration_Max,
	|	СУММА(DBMSCallDurationCurrent)/1000			КАК DBMSCallDuration_Current_Total, 
	|	МАКСИМУМ(DBMSCallDurationCurrent)/1000		КАК DBMSCallDuration_Current_Max,
	|	СУММА(CPUTimeCurrent)						КАК CPUTime_Current_Value,
	|	МАКСИМУМ(CPUTimeCurrent)					КАК CPUTime_Current_Max,
	|	СУММА(MemoryUsageCurrent)					КАК MemoryUsage_Current_Value,
	|	МАКСИМУМ(DBMSCallDurationCurrent)			КАК MemoryUsage_Current_Max
	|ИЗ
	|	ВТ_Сеансы
	|";
	
	Запрос.УстановитьПараметр("Сеансы", Сеансы);
	
	рЗапроса = Запрос.Выполнить();
	Выборка = рЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда	
		Поля = Новый Соответствие;
		Для каждого Поле Из рЗапроса.Колонки Цикл
			ПоказательИмя = ПреобразоватьИмяПоказателя(Поле.Имя);
			Поля[ПоказательИмя] = Выборка[Поле.Имя];
		КонецЦикла;
	Иначе
		Поля = Новый Соответствие;
		Для каждого Поле Из рЗапроса.Колонки Цикл
			ПоказательИмя = ПреобразоватьИмяПоказателя(Поле.Имя);
			Поля[ПоказательИмя] = 0;
		КонецЦикла;		
	КонецЕсли;	
	
	Результат = Новый Соответствие();
	Результат.Вставить("1c", Новый Структура("ras,additional", Поля, ДопПоказатели));	
	
	Возврат МаркировкаКС.ЗаписатьЖСОН(Результат);
КонецФункции //СоздатьФайлДляЗабикс(Сеансы)

Функция ОтправитьПоказателиВЗабикс(СтрокаДанных)
	ИмяВФ = ПолучитьИмяВременногоФайла("txt");
	
	ЗаписьТекста = Новый ЗаписьТекста(ИмяВФ, "CESU-8",, Ложь, Символы.ПС); //ТекстБезБОМ
	ЗаписьТекста.Записать(СтрокаДанных);
	ЗаписьТекста.Закрыть();
	
	ОтправитьФайлВЗабикс(ИмяВФ);
КонецФункции //ОтправитьПоказателиВЗабикс(СтрокаДанных)

Функция ОтправитьФайлВЗабикс(ИмяФайлаПоказателей)
	КомандаZabbix = СтрШаблон("""C:\Program Files\Zabbix Agent\zabbix_sender.exe"" -c ""C:\Program Files\Zabbix Agent\zabbix_agentd.conf"" -i ""%1""", ИмяФайлаПоказателей);
	//ЗапуститьПриложение(КомандаZabbix);    
	Файл = Новый Файл(ИмяФайлаПоказателей);
	КопироватьФайл(Файл.ПолноеИмя, КаталогВыгрузки + Файл.Имя);
КонецФункции // ()

Функция ПреобразоватьИмяПоказателя(Показатель)
	Возврат СтрЗаменить(НРег(Показатель), "_", "_");
КонецФункции //ПреобразоватьИмяПоказателя(Показатель)

Функция ИмяТекущейИБ()
	ИмяБазы = Макс(НСтр(СтрокаСоединенияИнформационнойБазы(),"Ref"),НСтр(СтрокаСоединенияИнформационнойБазы(),"File"));
	Возврат НРег(ИмяБазы);
КонецФункции //ИмяТекущейИБ()
 

ИмяЛога = "ВыгрузкаВZabbix";
ТипУИД	= Новый ОписаниеТипов("УникальныйИдентификатор");
ТипДата	= ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя);
